import { ImageData } from '../types/ImageGallery';

export const images: ImageData[] = [
    {
        imageId: 1,
        src: 'https://static.amanaimages.com/imgroom/rf_preview640/11038/11038024795.jpg',
        title: 'フランスの静かな朝', 
        text: 'この写真は、フランスの小さな町の穏やかな朝の風景を捉えたものです。石畳の道沿いには、古き良き時代を思わせるクラシックカーが静かに停められています。背景には、温かみのある黄色と深い緑色のファサードを持つ二軒の店舗が並んでいます。\n左側の建物は、カフェ「Le Temps Bonheur」で、地元の人々が朝食を楽しむ場所です。その隣にあるのは、緑色のファサードが特徴的なパン屋「Pâtisserie Boulangerie」。この店の窓には、美味しそうな焼きたてのパンやお菓子が並べられ、通りを行く人々の足を止めるでしょう。\nこの風景は、時間がゆっくりと流れる場所であり、フランスの小さな町で過ごす何気ないひと時の美しさを感じさせます。'
    },
    {
        imageId: 2,
        src: 'https://www.nta.co.jp/media/tripa/static_contents/nta-tripa/articles/images/000/000/418/medium/8342c3cf-fbb8-402a-9bd8-37fd7f1b8c33.jpg?1550646782',
        title: '静寂の湖と鳥居',
        text: 'この写真は、静寂な湖面に佇む鳥居を中心に捉えた、幻想的な風景を表現しています。空が薄暗くなる頃の青いグラデーションが、湖の水面と一体となり、幻想的で静かな雰囲気を醸し出しています。\n遠くの地平線にわずかに見える山々や、鳥居のシルエットが、時間の流れを超えた神秘的な空間を感じさせます。この鳥居は、湖に浮かぶように設置されており、水面に映るその姿が二重の美しさを生み出しています。\nこの風景は、日本の自然と神聖な文化の融合を象徴しており、見る者に深い静けさと畏敬の念を抱かせます。時間が止まったかのような、この瞬間を切り取った写真は、日常から離れた神聖な場所での一瞬の平穏を感じさせます。'
    },
    {
        imageId: 3,
        src: 'https://media.macphun.com/img/uploads/customer/blog/1700496127/1700496360655b83e8817ba2.21228327.jpg?q=85&w=1680',
        title: '夕暮れの虹彩',
        text: 'この写真は、鮮やかな夕焼けに包まれた湖の静かな風景を捉えています。空全体がピンク、紫、そしてオレンジ色のグラデーションで染まり、まるで絵画のような美しさを持っています。湖面もその色彩を映し出し、穏やかな波が立ち上がることで、空と水の境界がぼんやりと溶け合って見えます。\n画面右側に見える島影は、黒くシルエットとなり、周囲の鮮やかな色彩をさらに引き立てています。このシーンは、自然が見せる一瞬の壮麗さと、日常から離れた場所での静けさを象徴しています。\nこの写真は、日が沈みゆく時間の儚さと美しさを捉え、見る者に自然の力とその繊細な美を感じさせる作品です。'
    },
];